#### Inspecting the files

In [51]:
import pandas as pd
import numpy as np

-----------------------------

#### genome-scores.csv

In [2]:
df1 = pd.read_csv('DATA/genome-scores.csv', index_col=False)
df1.head()

   movieId  tagId  relevance
0        1      1    0.03200
1        1      2    0.02225
2        1      3    0.07000
3        1      4    0.05900
4        1      5    0.12300

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18472128 entries, 0 to 18472127
Data columns (total 3 columns):
 #   Column     Dtype
---  ------     -----
 0   movieId    int64
 1   tagId      int64
 2   relevance  float64
dtypes: float64(1), int64(2)
memory usage: 422.8 MB

In [4]:
df1.sample(n=5, random_state=1)

          movieId  tagId  relevance
12299649    81782   1066    0.14250
97964          88    957    0.01575
10490371    54349   1100    0.04575
16356208   172461    209    0.00625
1531471      1508    776    0.04450

In [5]:
df1.isna().sum()

movieId      0
tagId        0
relevance    0
dtype: int64

In [ ]:
df1['tagId'].duplicated().sum()

18471000

In [9]:
df1['movieId'].duplicated().sum()

18455752

In [48]:
df1.duplicated().sum()

0

In [50]:
df1['relevance'].max(), df1['relevance'].min()

(1.0, 0.0002499999999999)

---------

#### genome-tags.csv

In [6]:
df2 = pd.read_csv('DATA/genome-tags.csv', index_col=False)
df2.head()

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

In [15]:
df2.sample(n=5, random_state=1)

     tagId                tag
472    473               grim
582    583            judaism
483    484            hackers
908    909          sexuality
814    815  private detective

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1128 entries, 0 to 1127
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   tagId   1128 non-null   int64
 1   tag     1128 non-null   object
dtypes: int64(1), object(1)
memory usage: 17.8+ KB

In [12]:
df2.duplicated().sum()

0

In [13]:
df2['tag'].duplicated().sum()

0

In [14]:
df2['tagId'].duplicated().sum()

0

-----------

#### links.csv

In [16]:
df3 = pd.read_csv('DATA/links.csv', index_col=False)
df3.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [17]:
df3.sample(n=5, random_state=1)

       movieId    imdbId    tmdbId
5068      5173    127516   43997.0
48215   174959   5689610  461088.0
35283   146690     61626   42693.0
48434   175439    264333   21893.0
69337   223075  11902980  729648.0

In [18]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86537 entries, 0 to 86536
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  86537 non-null  int64
 1   imdbId   86537 non-null  int64
 2   tmdbId   86411 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 2.0 MB

In [19]:
df3['movieId'].duplicated().sum()

0

In [20]:
df3['imdbId'].duplicated().sum()

0

In [21]:
df3['tmdbId'].duplicated().sum()

162

In [22]:
df3.duplicated().sum()

0

In [27]:
df3[df3['tmdbId'].duplicated()]

       movieId    imdbId    tmdbId
715        730    125877       NaN
754        770     38426       NaN
775        791    113610       NaN
1080      1107    102336       NaN
1114      1142    116403       NaN
...        ...       ...       ...
78451   261883  12876132  703771.0
79680   266856    228933  264068.0
81327   272905   6725014  133919.0
82054   275753    219560  159898.0
84424   281988   8031054       NaN

[162 rows x 3 columns]

-----------

#### movies.csv

In [28]:
df4 = pd.read_csv('DATA/movies.csv', index_col=False)
df4.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [29]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86537 entries, 0 to 86536
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  86537 non-null  int64
 1   title    86537 non-null  object
 2   genres   86537 non-null  object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [30]:
df4['movieId'].duplicated().sum()

0

In [31]:
df4['title'].duplicated().sum()

207

In [35]:
df4[df4['title'].duplicated()][20:40]

,movieId,title,genres
34283,144440,Deranged (2012),Thriller
34286,144450,An Inspector Calls (2015),Action|Comedy
34363,144606,Confessions of a Dangerous Mind (2002),Comedy|Crime|Drama|Romance|Thriller
34434,144748,Inside (2012),Horror
34473,144830,The Tunnel (1933),(no genres listed)
35416,147002,Eros (2004),Drama|Romance
36042,148482,Truth (2015),Drama
36812,150310,Macbeth (2015),Drama
36965,150732,The Reunion (2011),Comedy
36984,150776,Tag (2015),Horror|Thriller
37219,151375,Slow Burn (2000),Adventure|Thriller
37413,151797,Absolution (2015),Drama|Thriller
38877,154943,Stranded (2015),Comedy
39608,156686,Another World (2014),(no genres listed)
40553,158763,The Connection (2014),Documentary
41037,159865,Captive (1998),Thriller
41060,159933,Showdown (1993),Drama
41254,160356,Shelter (2015),Drama|Sci-Fi|Thriller
41491,160868,Escalation (1968),(no genres listed)
42603,163206,Forsaken (2016),Horror

----------

#### ratings.csv

In [36]:
df5 = pd.read_csv('DATA/ratings.csv', index_col=False)
df5.head()

   userId  movieId  rating   timestamp
0       1        1     4.0  1225734739
1       1      110     4.0  1225865086
2       1      158     4.0  1225733503
3       1      260     4.5  1225735204
4       1      356     5.0  1225735119

In [37]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33832162 entries, 0 to 33832161
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 1.0 GB

In [38]:
df5.isna().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [52]:
df5.sample(n=10, random_state=1)

          userId  movieId  rating   timestamp
33179850  324684     3898     1.5  1144760809
16176049  158793      922     4.0  1450700720
32084054  313695     2423     4.0  1133582037
6082545    59202     5218     3.0  1033884899
16125818  158269     1779     2.0  1660913035
27097698  264464     1957     4.0   953067620
1315136    12727   106782     3.5  1653959620
32740492  319929     9018     3.5  1469934763
29604929  289257   166643     3.5  1515856802
6787316    66339     2105     4.0  1553843526

----------

#### tags.csv

In [39]:
df6 = pd.read_csv('DATA/tags.csv', index_col=False)
df6.head()

   userId  movieId            tag   timestamp
0      10      260   good vs evil  1430666558
1      10      260  Harrison Ford  1430666505
2      10      260         sci-fi  1430666538
3      14     1221      Al Pacino  1311600756
4      14     1221          mafia  1311600746

In [41]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2328315 entries, 0 to 2328314
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   tag        object
 3   timestamp  int64
dtypes: int64(3), object(1)
memory usage: 71.1+ MB

In [42]:
df6.isna().sum()

userId        0
movieId       0
tag          17
timestamp     0
dtype: int64

In [44]:
df6[df6['tag'].isna()]

         userId  movieId  tag   timestamp
530012   104413      123  NaN  1199450867
530013   104413      346  NaN  1199451946
530017   104413     1184  NaN  1199452261
530024   104413     1785  NaN  1199452006
530025   104413     2194  NaN  1199450677
530027   104413     2691  NaN  1199451002
530035   104413     4103  NaN  1199451920
530037   104413     4473  NaN  1199451040
530039   104413     4616  NaN  1199452441
530055   104413     7624  NaN  1199452266
530061   104413     8898  NaN  1199450757
530068   104413    32460  NaN  1199450901
530070   104413    33826  NaN  1199450703
530075   104413    36537  NaN  1199450736
530076   104413    55805  NaN  1199450941
675724   127778   281500  NaN  1670942104
1940149  240847    33826  NaN  1221450908

In [47]:
df6[df6['movieId'] == 4103]

         userId  movieId               tag   timestamp
30943      7716     4103       library vhs  1203866864
44377      8774     4103   based on a book  1457855038
44378      8774     4103             China  1457855058
44379      8774     4103  Steven Spielberg  1457855060
44380      8774     4103      World War II  1457855056
...         ...      ...               ...         ...
2269009  316227     4103            prison  1429140037
2269010  316227     4103  Steven Spielberg  1455671123
2269011  316227     4103      World War II  1429140030
2313040  327715     4103       NO_FA_GANES  1412779906
2322252  329954     4103      World War II  1478301643

[480 rows x 4 columns]

In [40]:
df6['userId'].value_counts()

userId
215490    723473
229729     20317
63350      19345
126357     17990
137062     16739
           ...
69304          1
69307          1
230662         1
69425          1
264001         1
Name: count, Length: 25280, dtype: int64

--------